web/contactsSoap/addUser.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="${namespace}">
    <env:Header/>
    <env:Body>
        <ns1:addUser>
            <newData>
                <item>
                    <key>first_name</key>
                    <value>${json.newData.first_name}</value>
                </item>
                <item>
                    <key>last_name</key>
                    <value>${json.newData.last_name}</value>
                </item>
                <item>
                    <key>email</key>
                    <value>${json.newData.email}</value>
                </item>
                <item>
                    <key>phone</key>
                    <value>${json.newData.phone}</value>
                </item>
            </newData>
        </ns1:addUser>
    </env:Body>
</env:Envelope>